cask "cyberduck"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "iterm2"
cask "lastpass"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "vnc-viewer"
cask "spotify"
cask "microsoft-edge"
